---
kind: property
id: P:Autodesk.Revit.DB.Toposolid.HostTopoId
source: html/d16ba5b3-da97-b262-3dc8-5de0a9816f74.htm
---
# Autodesk.Revit.DB.Toposolid.HostTopoId Property

The host toposolid id of the current toposolid subdivision.
 If the object is not a toposolid subdivision, hostTopoId will be InvalidElementId.

## Syntax (C#)
```csharp
public ElementId HostTopoId { get; }
```